Repository: ItsPops/cpige
Catalog: gui/cpige-*.po
Languages: fr

source: Open new configuration
fr: Ouvrir un fichier de configuration

source: No config file specified. Internal Error, aborting.
fr: Aucun fichier de configuration spécifié. Erreur interne, le programme va se terminer.

source: Error parsing config file. Aborting.
fr: Erreur de lecture du fichier de configuration. Annulation.

source: Configuration file is invalid. Aborting.
fr: Le fichier de configuration n'est pas valide. Annulation

source: An error was detected during the configuration building. Settings are not acceptable. Please reconfigure cPige. This would happens for example if you've not added an URL.
fr: Une erreur à été détectée lors de la construction du fichier de configuration. Les paramètres ne sont pas acceptables. Veuillez reconfigurer cPige. Cette erreur peut survenir par exemple si vous n'avez pas spécifié d'adresse.

source: Unable to open your config file for writing. Please verify rights.
fr: Impossible d'ouvrir le fichier de configuration en écriture. Vérifiez les droits d'accès.

source: Unable to open config file for writing. Settings will *NOT* be saved.
fr: Impossible d'ouvrir le fichier de configuration en écriture. Vérifiez les droits d'accès.

source: Warning, cPige is currently recording. Exiting will shutdown cPige. Do you really want to continue ?
fr: Attention, cPige est en cours d'enregistrement. Voulez vous vraiment quitter cPige?

source: You must save your configuration before launching cPige.
fr: Vous devez enregistrer votre configuration avant de lancer cPige.

source: Start
fr: Démarrer

source: Stop
fr: Arreter

source: Apply
fr: Appliquer

source: cPige existed.
fr: cPige s'est terminé.

source: cPige Configurator by Laurent Coustet
fr: cPige, par Laurent Coustet

source: Add an URL to the pool.
fr: Ajouter une adresse

source: Add
fr: Ajouter

source: Remove an URL from the pool.
fr: Supprimer une adresse

source: Del
fr: Supprimer

source: Save directory
fr: Répertoire d'enregistrement

source: File selection
fr: Sélectionnez un fichier

source: Do you want cPige to store his action in a logfile ?
fr: Voulez vous que cPige note ses actions dans un fichier de log?

source: Open
fr: Ouvrir

source: Split files every
fr: Découper toute les

source: Each n "Hour" or "Minutes", cPige will create a new file.
fr: Toute les n "Heures" ou "Minutes", cPige va créer un nouveau fichier.

source: Hour(s)
fr: Heure(s)

source: <b>Pige mode only</b>
fr: <b>Mode pige seulement</b>

source: <b>Mandatory parameters</b>
fr: <b>Paramètres obligatoires</b>

source: Do you want cPige to archive the stream in Pige mode? In pige mode, cPige will cut the stream using a time base.
fr: Voulez vous que cPige travaille en mode pige ? En mode pige, cPige va couper les fichiers par tranches horaires, et non plus par changement de titre.

source: week backup
fr: mode semaine

source: Do you want cPige to archive a complete week of streaming?
fr: Voulez vous que cPige enregistre une semaine complete de flux ?

source: Do you want cPige to add ID3 tags to your piged files (Only available using pige mode)
fr: Voulez vous que cPige ajoute des tags ID3 aux fichiers créés avec notament le nom de la radio ? (Seulement en mode pige)

source: quiet mode
fr: Silencieux

source: Do you want cPige to gives you the status of the stream grabbing ? Like the title of the song played, the time cPige is running, and so on. Note that this parameter is useless starting cPige with the GUI.
fr: Voulez vous que cPige vous informe en console de l'état de la récupération du stream ?

source: background
fr: Tâche de fond

source: Do you want to run cPige in background mode. <b>This option is currently ONLY available under UNIX systems.</b>
fr: Voulez vous que cPige tourne en mode "background" ? <b>Fonctionnalitée accessible UNIQUEMENT pour les systèmes UNIX.</b>

source: use numbers
fr: préfixer

source: Should cPige prefix songs with a unique number ? (UNIX only, with pige mode Disabled)
fr: cPige doit il préfixer les chansons récupérées d'un identifiant unique ? <b>Uniquement sous UNIX</b>

source: How many songs cPige should skip before starting recording
fr: Combien de chanson cPige doit ignorer avant de commencer son travail ?

source: This entry is used by cPige to detect if the new title sent by the webradio is a "next title" information, or a real new title.
fr: Ce champ permet a cPige de ne pas réagir lorsque certaine radios changent le titre d'une chanson pour annoncer le titre avenir. Mettez par exemple "A suivre" pour fréquence3.

source: <b>Extra Parameters</b>
fr: <b>Paramètres superflus</b>

source: This button is used to start / stop cPige recording
fr: Ce bonton permet de lancer cPige directement depuis l'interface.

source: Current song
fr: En ce moment

source: Next song
fr: Prochaine chanson

source: This is the title of the song currently recording
fr: C'est le titre de la chanson actuellement enregistré.

source: This is the title of the next song we are going to record.
fr: C'est le titre de la prochaine chanson qui va être jouée.

source: timeleft
fr: temps restant

source: <b>Stream status</b>
fr: <b>Status du stream</b>

source: Add an URL
fr: Ajouter une adresse

source: Type the URL of the stream.
fr: Tapez l'adresse du stream

source: Select a logfile
fr: Sélectionner un fichier de log

source: Confirm
fr: Confirmer

source: Warning, using new will destroy all unsaved settings.
fr: Attention, utiliser le bouton nouveau va détruire tous les paramètres non sauvegardés.

source: Invalid config file: no savedirectory specified.
fr: Fichier de configuration invalide: le répertoire de sauvegarde n'a pas été spécifié.

source: Invalid configuration: no URL specified.
fr: Fichier de configuration invalide: aucune adresse de serveur spécifiée.
